---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index2
source: html/2bb2127b-06bd-6b7e-caa9-93e5aed2ba7e.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexTriangle.Index2 Property

The index of the triangle's third vertex.

## Syntax (C#)
```csharp
public int Index2 { get; set; }
```